#!/usr/bin/env bash

text="hello"
echo "$text"
# --------------------------------------------------------------
second_str="world!"
text="$text, $second_str"                                       # обьединение строк     # Hello, world!
echo "$text"
# --------------------------------------------------------------
leng="${#text}"                                                 # количество символов   # 13
echo "$leng"
# --------------------------------------------------------------
# ${параметр:смещение}
# ${параметр:смещение:длина}
echo ${first_part="text:4"}                                     # Если переменная first_part не определена или пуста, → ей присваивается значение "text:4"
echo "${text:7}"                                                # вывод начиная с 7символа  # world!
echo "${text:7:5}"                                              # вывести только 5 символов начиная с 7го  # world
echo ${text: -6:5}                                              # отсчет начнется с конца строки вместоначала 
# --------------------------------------------------------------
string_for_replace="I like cats"
echo "${string_for_replace/cat/dog}"                            # замена подстроки # I like dogs
echo "${string_for_replace//cat/dog}"                           # замена всех подстрок # I like dogs
# --------------------------------------------------------------
# ==============================================================
# возвращают значение параметра, удаляя из него начальную часть, определяемую указанным шаблоном.
# ${параметр#шаблон}
# ${параметр##шаблон}
text="hello world!"
sub="rld"
after="${text#*$sub}"                                            # обрезать(удалить) все перед подстрокой "rld" включительно # !
echo "$after"                       # > "!"

foo=file.txt.zip
echo ${foo#*.}                      # > "txt.zip"
# форма ## удаляет самое длинное совпадение:
echo ${foo##*.}                     # > "zip"
echo ${0##*/}                       # обрезать директорию

text="hello world"
result="${text#???}"                                               # удалить первые N символов из строки # lo world
echo "$result"                      # > "lo world"
# --------------------------------------------------------------
# удаляют текст с конца строки, содержащейся в параметре:
# ${параметр%шаблон}
# ${параметр%%шаблон}

text="hello world"
result="${text%???}"                                               # Удаление последних символов (%) # hello wo
echo "$result"                      # > "hello wo"

text="hello world!"
sub="rld"
before="${text%%$sub*}"                                            # обрезать(удалить) все после подстроки "rld" включительно # hello wo
echo "$before"                      # > "hello wo"

foo=file.txt.zip
echo ${foo%.*}                      # > "file.txt"
# форма %% удаляет самое длинное совпадение:
echo ${foo%%.*}                     # > "file"

# ==============================================================
# Следующие формы выполняют поиск с заменой в содержимом указанного параметра:
# ${параметр/шаблон/строка}         # заменит только первое совпадение с шаблоном
# ${параметр//шаблон/строка}        # заменит все найденные совпадения
# ${параметр/#шаблон/строка}        # только если совпадение найдено в самом начале строки
# ${параметр/%шаблон/строка}        # только если совпадение найдено в конце строки

foo=JPG.JPG
echo ${foo/JPG/jpg}                 # > "jpg.JPG"
echo ${foo//JPG/jpg}                # > "jpg.jpg"
echo ${foo/#JPG/jpg}                # > "jpg.JPG"
echo ${foo/%JPG/jpg}                # > "JPG.jpg"

# ==============================================================
# Преобразование регистра символов
arg="HELLO_world!"
declare -u upper
declare -l lower

upper="$arg" && echo "$upper"       # > "HELLO_WORLD!"
lower="$arg" && echo "$lower"       # > "hello_world!"
# --------------------------------------------------------------
# Операции подстановки параметров, выполняющие преобразование регистра символов
# ${параметр,,шаблон}               # Возвращает значение все символы в нижнем регистре
# ${параметр,шаблон}                # Возвращает значение первый символ в нижнем регистре
# ${параметр^^шаблон}               # Возвращает значение все символы в верхний регистр
# ${параметр^шаблон}                # Возвращает значение первый символ в верхнем ригистре

example="aBc"
echo "${example,,}"                 # > "abc"
echo "${example,}"                  # > "aBc"
echo "${example^^}"                 # > "ABC"
echo "${example^}"                  # > "ABc"



# --------------------------------------------------------------
# разделить строку
path=$(pwd)
echo $0
full_path=$path/$0
echo "$full_path"
text="/home/dm/WebstormProjects/bash/start_bash"


text="hello world"
sub="o"

pos=$(expr index "$text" "$sub")
echo "$pos"



# ======================================================================


exit 0