#!/bin/bash

# Подстановка фигурных скобок

# Внутри фигурных скобок находится список строк, разделенных запятыми, или
# диапазон целых чисел или одиночных символов. Использование пробелов внутри
# фигурных скобок не допускается.

echo Ahead-{A,B,C}-behind         # Ahead-A-behind Ahead-B-behind Ahead-C-behind
# ===========================================================
# использование диапазона целых чисел:
echo Number_{1..5}                   # Number_1 Number_2 Number_3 Number_4 Number_5

# ===========================================================
# В версии bash 4.0 и выше целые числа можно дополнять ведущими нулями
echo {01..15}       # 01 02 03 04 05 06 07 08 09 10 11 12 13 14 15
echo {001..15}      # 001 002 003 004 005 006 007 008 009 010 011 012 013 014 015
echo {Z..A}         # Z Y X W V U T S R Q P O N M L K J I H G F E D C B A
# вложение фигурных скобок:
echo a{A{1,2},B{3,4}}b  #aA1b aA2b aB3b aB4b


# [me@linuxbox ~]$ mkdir Photos
# [me@linuxbox ~]$ cd Photos
# [me@linuxbox Photos]$ mkdir {2007..2009}-{01..12}
# [me@linuxbox Photos]$ ls
# 2007-01 2007-07 2008-01 2008-07 2009-01 2009-07
# 2007-02 2007-08 2008-02 2008-08 2009-02 2009-08
# 2007-03 2007-09 2008-03 2008-09 2009-03 2009-09
# 2007-04 2007-10 2008-04 2008-10 2009-04 2009-10
# 2007-05 2007-11 2008-05 2008-11 2009-05 2009-11
# 2007-06 2007-12 2008-06 2008-12 2009-06 2009-12




exit 0