#!/bin/bash

# создать массив
arr=(one two three)
arr[3]="4"
arr[4]="5"

echo "${arr[@]}"                        # чтение всех элементов
echo "${arr[*]}"                        # все элементы одной строкой
echo "${#arr[@]}"                       # количество элементов
echo "${!arr[@]}"                       # Список индексов > 0 1 2 3 4

arr[1]="TWO"                            # Замена элемента по индексу

# массовая замена через цикл
for i in "${!arr[@]}"; do
    arr[$i]="${arr[$i]}_X"
done
echo "${arr[@]}"


unset arr[1]                            # удаления элемента, индекс тоже удаляется, 
echo "${!arr[@]}"                       # Список индексов > 0 2 3 4


arr+=(four)                             # Добавление элемента в конец массива
arr[10]="ten"                           # Добавление элемента по индексу
# -------------------------------------------------------------------------------
# clice формат: ${array[@]:start:length}
arr=(one two three four five)
arr_slice=("${arr[@]:0:3}")
echo "${arr[@]:3}"
echo "${arr[@]}"                           # one two three four five
echo "${arr_slice[@]}"                     #     two three four
# ==============================================================================

# поиск по массиву (есть ли точное совпадение) 
value="two"
found=false

for x in "${arr_slice[@]}"; do
    [ "${x}" = "${value}" ] && found=true
done
echo "${found}"
# -------------------------------------------------------------------------------
# поиск индекса элемента
for x in "${!arr_slice[@]}"; do
    [ "${arr_slice[${x}]}" = "${value}" ] && echo "Index: ${x}"
done
# -------------------------------------------------------------------------------
# проверка на существование элемента
[ -v arr_slice[1] ] && echo "exists"
# проверка на массив пуст?
(( "${#arr_slice[@]}" == 0 )) && echo "empty"
# -------------------------------------------------------------------------------
# Копирование массива
copy_arr=("${arr[@]}")

# ==============================================================================
# Сортировка массива
arr_int=(2 9 10 99 1 0)
sorted=($(printf "%s\n" "${arr_int[@]}" | sort))
echo "${sorted[@]}"
# ==============================================================================
# Удаление элемента по значению (Удаляет первое совпадение) 
value="two"
arr=(one two three)
echo "${arr[@]}"
arr=("${arr[@]/$value}")
echo "${arr[@]}"
for i in "${arr[@]}"; do
    echo "${i}"
done

exit 0



value="two"
